module.exports = {
    date: {
        msg: '输入正确的日期',
        reg: /^\d{4}[-\/]\d{1,2}[-\/]\d{1,2}/,
    },
    phone: {
        msg: '输入正确的手机号', reg: /^1[3-8]{1}[0-9]{9}$/,
    },
    num: {
        msg: '输入正确的数字', reg: /^\d+?[\.]\d*$/
    },
    comname: {
        msg: '输入正确的姓名', reg: /^[a-zA-Z_\u4E00-\u9FFF]{2,20}$/
    },
    unm:{
        msg:'输入合法的字符',reg:/^[a-zA-Z_[0-9]]{4,20}$/
    },
    special:{
        msg:'存在特殊字符',reg: /[`~!@#$%^&*()_\-+=<>?:"{}|,.\/;'\\[\]·~！@#￥%……&*（）——\-+={}|《》？：“”【】、；‘’，。、]/im
    },
    web: {
        msg: '输入正确的网址', reg: /(http|ftp|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-\.,@?^=%&:/~\+#]*[\w\-\@?^=%&/~\+#])?/
    },
    email: {
        msg: '输入正确的邮箱地址', reg: /^[0-9|a-z|A-Z|_]*?@[0-9|a-z|A-Z|_]+?\.[0-9|a-z|A-Z]+?$/
    },
}